Tekla Open API Reference for Tekla Structures 2025
Events.ViewCameraChangedDelegate Delegate
 The delegate to use for view camera changed event
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public delegate void ViewCameraChangedDelegate(
	Identifier ViewId
)
Public Delegate Sub ViewCameraChangedDelegate (
	ViewId As Identifier
)
Parameters
ViewId
Type: Tekla.Structures.Identifier
See Also
Reference
Tekla.Structures.Model Namespace